In [1]:
# Standard imports
import numpy as np
import pandas as pd

# For statistical modeling
import scipy.stats as stats
from math import sqrt 

# For data visualization
import seaborn as sns
import matplotlib.pyplot as plt

# To avoid deprecation and other warnings
import warnings
warnings.filterwarnings('ignore')

# For modeling
# to evaluated performance using rmse
from sklearn.metrics import mean_squared_error
# holt's linear trend model
from statsmodels.tsa.api import Holt
import statsmodels.api as sm

from matplotlib.ticker import StrMethodFormatter
from matplotlib.dates import DateFormatter

# working with dates
from datetime import datetime

import os

url = 'https://www.fhwa.dot.gov/ohim/tvtw/archive/arch92u.htm'
df = pd.read_csv(url)

from requests import get
from bs4 import BeautifulSoup

url = 'https://codeup.com/data-science/math-in-data-science/'
headers = {'User-Agent': 'Codeup Data Science'} # Some websites don't accept the pyhon-requests default user-agent
response = get(url, headers=headers)

soup = BeautifulSoup(response.content, 'html.parser')

s = get('https://www.fhwa.dot.gov/ohim/tvtw/archive/arch92u.htm')

soup.prettify()

response = get('https://www.fhwa.dot.gov/ohim/tvtw/archive/arch92u.htm')
soup = BeautifulSoup(response.content, 'html.parser')

soup.prettify()

soup.title.string

soup.get_text()

soup.select("footer")

In [2]:
#traffic = '/Users/everettclark/Downloads/TMS_traffic_counts/TMS_traffic_counts.csv'
#cspath = '/Users/everettclark/Downloads/archive (1)'
path2 = '/Users/everettclark/Downloads/archive (3)'

df = pd.read_csv(traffic)

df

df.isnull().sum()

df.info()

df.siteDescription.value_counts()

df.flowDirection.value_counts()

sns.scatterplot(x=df.laneNumber, y=df.trafficCount, hue=df.flowDirection)

df = pd.read_csv(f'{cspath}/esea_master_dmg_demos.part1.csv')

df

df.columns

df = pd.read_csv(f'{cspath}/map_data.csv')
df

## Age Specific Fertility Rates

In [3]:
asf = pd.read_csv(f'{path2}/age_specific_fertility_rates.csv')
print(asf.shape)
asf.drop(columns='country_code', inplace=True)
asf.head()

(15106, 13)

,country_name,year,fertility_rate_15_19,fertility_rate_20_24,fertility_rate_25_29,fertility_rate_30_34,fertility_rate_35_39,fertility_rate_40_44,fertility_rate_45_49,total_fertility_rate,gross_reproduction_rate,sex_ratio_at_birth
0,Slovenia,2036,8.5,60.2,112.0,86.3,32.0,8.8,3.7,1.5555,0.7529,1.0660
1,Slovenia,2022,7.5,56.4,106.1,75.5,26.7,6.4,2.3,1.4110,0.6829,1.0661
2,Slovenia,2023,7.6,56.5,106.6,76.2,27.2,6.6,2.4,1.4213,0.6879,1.0660
3,Slovenia,2024,7.7,56.8,107.0,77.1,27.5,6.7,2.5,1.4316,0.6929,1.0660
4,Slovenia,2025,7.7,56.9,107.4,78.0,27.7,6.9,2.6,1.4419,0.6979,1.0661

#### I have other info that I can use for birth/death

---

## Country Areas:

In [4]:
pd.read_csv(f'{path2}/country_names_area.csv').head(3)

  country_code country_name  country_area
0           AF  Afghanistan      652230.0
1           AL      Albania       27398.0
2           AG      Algeria     2381741.0

#### Not needed

---

## Age 5 Midyear Populations:

In [5]:
mp5 = pd.read_csv(f'{path2}/midyear_population_5yr_age_sex.csv')
mp5.drop(columns='country_code', inplace=True)
print(mp5.shape)
mp5.sort_values(by='country_name').head()

(333080, 9)

,country_name,year,total_flag,starting_age,age_group_indicator,ending_age,midyear_population,midyear_population_male,midyear_population_female
279318,Afghanistan,2017,A,95,-,99,273,99,174
244100,Afghanistan,2040,A,15,-,19,5727704,2908688,2819016
193531,Afghanistan,2038,A,50,-,54,1873174,935379,937795
50334,Afghanistan,2025,A,0,-,4,6055219,3079206,2976013
127363,Afghanistan,1985,A,25,-,29,995440,510940,484500

#### Not going to use

---

## Midyear Population country code:

In [6]:
mpc = pd.read_csv(f'{path2}/midyear_population_age_country_code.csv')
mpc.sort_values(by='country_name').head(3)

,country_code,country_name,year,sex,max_age,population_age_0,population_age_1,population_age_2,population_age_3,population_age_4,...,population_age_94,population_age_95,population_age_96,population_age_97,population_age_98,population_age_99,population_age_100,age,permutation_role,population
2460213,AF,Afghanistan,2050,Male,100,699328,685484,678841,673365,668619,...,586,388,240,143,82,49,59,88,child,4827
2201225,AF,Afghanistan,2024,Male,100,653702,620418,604670,592017,579188,...,107,65,35,21,11,7,6,61,child,73743
65574,AF,Afghanistan,2014,Male,100,573665,528794,505300,487940,472797,...,70,43,24,10,6,4,3,29,child,220315

mpc.sort_values(by='country_name').head(15)

mpc.country_name.value_counts()

mpc[(mpc.country_name =='Afghanistan') & (mpc.sex == 'Male') & (mpc.year == 1979)].describe()

### Not using

---

## Midyear Population age sex:

In [7]:
mpa = pd.read_csv(f'{path2}/midyear_population_age_sex.csv')
mpa.drop(columns='country_code', inplace=True)
print(mpa.shape)
mpa.head(10)

(30280, 105)

,country_name,year,sex,max_age,population_age_0,population_age_1,population_age_2,population_age_3,population_age_4,population_age_5,...,population_age_91,population_age_92,population_age_93,population_age_94,population_age_95,population_age_96,population_age_97,population_age_98,population_age_99,population_age_100
0,Afghanistan,1979,Male,100,318425,299061,282850,268400,255599,244330,...,170,109,67,42,24,14,8,4,2,2
1,Afghanistan,1980,Female,100,303582,253596,255259,249053,239924,232073,...,71,45,27,16,9,6,3,1,1,1
2,Afghanistan,1981,Male,100,278483,253006,228441,233548,226679,220238,...,169,108,67,41,24,14,8,4,2,2
3,Afghanistan,1982,Male,100,260493,226577,217475,198617,205456,200768,...,168,108,67,41,24,14,7,5,2,2
4,Afghanistan,1986,Male,100,288288,244977,225403,207463,204496,195268,...,159,108,67,40,25,13,8,4,2,2
5,Afghanistan,1988,Male,100,305181,262454,238563,218362,205439,190337,...,77,82,64,42,23,14,9,3,3,1
6,Afghanistan,1990,Male,100,324569,283502,259125,240125,223228,206840,...,92,52,31,32,24,14,7,5,3,1
7,Afghanistan,1992,Female,100,354761,310868,285194,268144,251210,232928,...,96,64,35,18,12,7,6,3,1,2
8,Afghanistan,1995,Female,100,447128,395670,363178,348926,332989,316915,...,101,59,36,26,17,8,4,3,0,3
9,Afghanistan,1996,Female,100,463943,411579,381929,356762,344747,330183,...,118,69,38,23,16,10,5,2,2,2

In [8]:
mpa[mpa.country_name == 'Afghanistan'].year.value_counts()

1979    2
1980    2
2012    2
2009    2
2005    2
       ..
2021    2
2019    2
2017    2
2016    2
2043    2
Name: year, Length: 72, dtype: int64

In [9]:
mpa[mpa.country_name == 'Afghanistan'].sort_values(by='year')

,country_name,year,sex,max_age,population_age_0,population_age_1,population_age_2,population_age_3,population_age_4,population_age_5,...,population_age_91,population_age_92,population_age_93,population_age_94,population_age_95,population_age_96,population_age_97,population_age_98,population_age_99,population_age_100
0,Afghanistan,1979,Male,100,318425,299061,282850,268400,255599,244330,...,170,109,67,42,24,14,8,4,2,2
20162,Afghanistan,1979,Female,100,299276,284224,270908,258667,247496,237362,...,69,43,26,15,9,5,3,2,0,1
1,Afghanistan,1980,Female,100,303582,253596,255259,249053,239924,232073,...,71,45,27,16,9,6,3,1,1,1
20163,Afghanistan,1980,Male,100,313513,270554,270040,260662,249193,239909,...,169,108,68,41,24,14,8,4,2,2
10055,Afghanistan,1981,Female,100,269398,245322,212463,219832,216190,211718,...,74,46,29,17,9,5,4,2,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20203,Afghanistan,2048,Male,100,697565,680954,673225,667942,662679,656964,...,1621,1149,797,515,322,196,123,74,42,48
10106,Afghanistan,2049,Female,100,670697,657731,650804,645829,641695,637315,...,3636,2599,1906,1368,921,599,382,247,156,199
10105,Afghanistan,2049,Male,100,698911,683655,675968,670535,665963,661149,...,1764,1195,828,562,355,217,128,79,47,52
10107,Afghanistan,2050,Male,100,699328,685484,678841,673365,668619,664476,...,1918,1303,864,586,388,240,143,82,49,59
48,Afghanistan,2050,Female,100,671003,659370,653446,648441,644139,640421,...,3977,2841,1994,1434,1008,665,423,264,167,224

In [10]:
mpa.columns

Index(['country_name', 'year', 'sex', 'max_age', 'population_age_0',
       'population_age_1', 'population_age_2', 'population_age_3',
       'population_age_4', 'population_age_5',
       ...
       'population_age_91', 'population_age_92', 'population_age_93',
       'population_age_94', 'population_age_95', 'population_age_96',
       'population_age_97', 'population_age_98', 'population_age_99',
       'population_age_100'],
      dtype='object', length=105)

In [11]:
mpa.max_age.min()

80

In [12]:
mpa.iloc[:1]

,country_name,year,sex,max_age,population_age_0,population_age_1,population_age_2,population_age_3,population_age_4,population_age_5,...,population_age_91,population_age_92,population_age_93,population_age_94,population_age_95,population_age_96,population_age_97,population_age_98,population_age_99,population_age_100
0,Afghanistan,1979,Male,100,318425,299061,282850,268400,255599,244330,...,170,109,67,42,24,14,8,4,2,2

mpa.iloc[:1].columns[5:]

---

## Midyear Population:

In [13]:
mp1 = pd.read_csv(f'{path2}/midyear_population.csv')
mp1.drop(columns='country_code', inplace=True)
print(mp1.shape)
mp1.head(10)

(23028, 3)

  country_name  year  midyear_population
0     Slovenia  2013             1992690
1     Slovenia  2025             1907560
2     Slovenia  2024             1917093
3     Slovenia  2023             1926279
4     Slovenia  2022             1935080
5     Slovenia  2021             1943453
6     Slovenia  2020             1951358
7     Slovenia  2019             1958778
8     Slovenia  2018             1965706
9     Slovenia  2017             1972126

mp1[(mp1.country_name == 'Norway') &(mp1.year == 2036)]

In [14]:
for col in mp1:
    print(mp1[col].value_counts())
    print('--------')

Slovenia               101
Bangladesh             101
Ireland                101
Virgin Islands U.S.    101
Gambia The             101
                      ...
Montserrat             101
Panama                 101
Macau                  101
Nepal                  101
Solomon Islands        101
Name: country_name, Length: 228, dtype: int64
--------
2013    228
1999    228
1952    228
1953    228
1954    228
       ...
2046    228
2047    228
2048    228
2049    228
1975    228
Name: year, Length: 101, dtype: int64
--------
8500        4
8300        4
107580      3
7852        3
7791        3
           ..
27087450    1
27087181    1
27082378    1
27073044    1
193000      1
Name: midyear_population, Length: 22880, dtype: int64
--------

pd.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)

In [50]:
pd.pivot_table(mp1, values='midyear_population', index='country_name', columns='year')

year,1950,1951,1952,1953,1954,1955,1956,1957,1958,1959,...,2041,2042,2043,2044,2045,2046,2047,2048,2049,2050
country_name,,,,,,,,,,,,,,,,,,,,,
Afghanistan,8150368,8284473,8425333,8573217,8728408,8891209,9061938,9240934,9428556,9624606,...,55619723,56524253,57432905,58343854,59255165,60165568,61075545,61985148,62892446,63795418
Albania,1227156,1254119,1282697,1314608,1352982,1392164,1434476,1476505,1521417,1571329,...,2978173,2962049,2945632,2928959,2912050,2894917,2877563,2859983,2842146,2824012
Algeria,8892718,9073304,9279525,9531710,9611093,9841851,10057133,10270856,10484925,10696396,...,52413932,52795174,53170494,53537501,53893778,54237145,54565705,54877585,55171092,55444735
American Samoa,19100,19500,19300,19200,19500,19800,20100,20300,20500,20400,...,49994,49827,49683,49561,49461,49384,49332,49303,49296,49308
Andorra,6176,6310,5866,5591,5503,6189,6221,6424,7103,7239,...,80614,80099,79549,78963,78341,77686,76998,76280,75534,74765
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
West Bank,771165,774512,777872,781247,784637,788042,791462,794895,798345,801809,...,3878368,3918203,3957435,3996023,4033925,4071177,4107818,4143794,4179053,4213540
Western Sahara,9057,10133,11336,12682,14187,15872,17756,19864,22222,24860,...,1014876,1032578,1050278,1067959,1085605,1103223,1120822,1138386,1155900,1173350
Yemen,4777089,4869125,4963829,5061153,5162494,5265327,5380106,5498090,5619377,5743926,...,41667902,42188741,42703176,43210273,43709073,44199728,44682648,45157387,45623514,46080625
Zambia,2553000,2611000,2672000,2734000,2800000,2869000,2941000,3016000,3094000,3173000,...,31141999,31959667,32791505,33637166,34496266,35368942,36255336,37155040,38067622,38992619
Zimbabwe,2853151,2950941,3080907,3190967,3307273,3409017,3529739,3646340,3764157,3886947,...,22162763,22490092,22820864,23154725,23491259,23829993,24170434,24512164,24854858,25198196

#### Not going to use

---

## Birth Death Growth Rates

In [15]:
bd = pd.read_csv(f'{path2}/birth_death_growth_rates.csv')
bd.drop(columns='country_code', inplace=True)
print(bd.shape)
bd.head()

(15109, 7)

,country_name,year,crude_birth_rate,crude_death_rate,net_migration,rate_natural_increase,growth_rate
0,Slovenia,2036,7.59,14.65,0.23,-0.706,-0.682
1,Slovenia,2022,7.52,12.28,0.32,-0.476,-0.444
2,Slovenia,2023,7.43,12.41,0.31,-0.498,-0.467
3,Slovenia,2024,7.35,12.55,0.31,-0.520,-0.489
4,Slovenia,2025,7.30,12.68,0.30,-0.538,-0.508

In [16]:
bd.tail(3)

,country_name,year,crude_birth_rate,crude_death_rate,net_migration,rate_natural_increase,growth_rate
15106,Solomon Islands,1998,35.98,4.70,-2.45,3.128,2.884
15107,Solomon Islands,1997,36.44,4.79,-2.31,3.165,2.934
15108,Solomon Islands,1995,37.17,4.97,-2.01,3.220,3.019

---

## Mortality Life Expentancy

In [17]:
mo = pd.read_csv(f'{path2}/mortality_life_expectancy.csv')
# I don't need all these columns, I'll take the average of each
mo.drop(columns={'country_code','infant_mortality_male','infant_mortality_female','life_expectancy_male',
                'life_expectancy_female','mortality_rate_under5_male','mortality_rate_under5_female',
                 'mortality_rate_1to4_male','mortality_rate_1to4_female'}, inplace=True)
print(mo.shape)
mo.head(10)

(15106, 6)

,country_name,year,infant_mortality,life_expectancy,mortality_rate_under5,mortality_rate_1to4
0,Slovenia,2036,3.39,80.90,3.93,0.54
1,Slovenia,2022,3.76,79.11,4.43,0.68
2,Slovenia,2023,3.73,79.26,4.39,0.67
3,Slovenia,2024,3.70,79.40,4.35,0.65
4,Slovenia,2025,3.67,79.55,4.31,0.64
5,Slovenia,2026,3.64,79.68,4.26,0.63
6,Slovenia,2027,3.61,79.81,4.23,0.63
7,Slovenia,2028,3.58,79.94,4.19,0.61
8,Slovenia,2029,3.56,80.08,4.15,0.60
9,Slovenia,2030,3.53,80.21,4.12,0.60

In [18]:
mo.tail(3)

,country_name,year,infant_mortality,life_expectancy,mortality_rate_under5,mortality_rate_1to4
15103,Solomon Islands,1998,27.45,70.7,34.71,7.46
15104,Solomon Islands,1997,28.38,70.4,35.97,7.81
15105,Solomon Islands,1995,30.33,69.8,38.64,8.57

In [19]:
mo.country_name.value_counts()

Bhutan                 101
Djibouti               101
Nigeria                 98
Guinea                  96
Cambodia                89
                      ...
Virgin Islands U.S.     51
South Sudan             43
Sudan                   43
Puerto Rico             41
United States           37
Name: country_name, Length: 228, dtype: int64

In [20]:
mo[mo.country_name == 'Bhutan']
print(mo[mo.country_name == 'Bhutan'].year.min())
print(mo[mo.country_name == 'Bhutan'].year.max())

1950
2050

In [21]:
mo[mo.country_name == 'United States']
print(mo[mo.country_name == 'United States'].year.min())
print(mo[mo.country_name == 'United States'].year.max())

2014
2050

In [22]:
len(mo[mo.year ==2014])

228

In [23]:
len(mo[mo.year == 2050])

228

In [24]:
mo[mo.year == 2014]

,country_name,year,infant_mortality,life_expectancy,mortality_rate_under5,mortality_rate_1to4
53,Slovenia,2014,4.04,77.83,4.83,0.80
116,Latvia,2014,5.44,74.01,6.81,1.37
178,Mongolia,2014,23.15,68.98,27.78,4.73
241,Mauritania,2014,56.06,62.28,84.47,30.10
276,Liberia,2014,69.19,58.21,102.53,35.82
...,...,...,...,...,...,...
14818,Azerbaijan,2014,26.67,71.91,29.59,3.00
14878,Saint Pierre and Miquelon,2014,6.95,80.26,7.94,0.99
14933,Northern Mariana Islands,2014,5.50,77.64,6.81,1.32
14959,Chad,2014,90.30,49.44,151.71,67.50
15049,Solomon Islands,2014,16.17,74.89,19.71,3.60

In [25]:
(mo.year.value_counts() == 228).sum()

37

---

## World Population

In [26]:
world = pd.read_csv('/Users/everettclark/Downloads/World Population Live Dataset.csv')
world.drop(columns='CCA3', inplace=True)
print(world.shape)
world.sort_values(by='Name').head()

(234, 14)

,Name,2022,2020,2015,2010,2000,1990,1980,1970,Area (km²),Density (per km²),GrowthRate,World Population Percentage,Rank
35,Afghanistan,41129,38972,33753,28190,19543,10695,12487,10753,652230,63.0587,1.03,0.52%,36
137,Albania,2842,2867,2882,2913,3182,3295,2942,2325,28748,98.8702,1.00,0.04%,138
33,Algeria,44903,43452,39543,35856,30775,25518,18739,13796,2381741,18.8531,1.02,0.56%,34
212,American Samoa,44,46,51,55,58,48,33,27,199,222.4774,0.98,0.00%,213
202,Andorra,80,78,72,72,66,54,36,20,468,170.5641,1.01,0.00%,203

In [27]:
world

,Name,2022,2020,2015,2010,2000,1990,1980,1970,Area (km²),Density (per km²),GrowthRate,World Population Percentage,Rank
0,China,1425887,1424930,1393715,1348191,1264099,1153704,982372,822534,9706961,146.8933,1.00,17.88%,1
1,India,1417173,1396387,1322867,1240614,1059634,870452,696828,557501,3287590,431.0675,1.01,17.77%,2
2,United States,338290,335942,324608,311183,282399,248084,223140,200328,9372610,36.0935,1.00,4.24%,3
3,Indonesia,275501,271858,259092,244016,214072,182160,148177,115228,1904569,144.6529,1.01,3.45%,4
4,Pakistan,235825,227197,210969,194454,154370,115414,80624,59291,881912,267.4018,1.02,2.96%,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
229,Montserrat,4,5,5,5,5,11,11,11,102,43.0392,0.99,0.00%,230
230,Falkland Islands,4,4,3,3,3,2,2,2,12173,0.3105,1.00,0.00%,231
231,Niue,2,2,2,2,2,3,4,5,260,7.4385,1.00,0.00%,232
232,Tokelau,2,2,1,1,2,2,2,2,12,155.9167,1.01,0.00%,233
233,Vatican City,1,1,1,1,1,1,1,1,1,510.0000,1.00,0.00%,234

### Rank is by World Population Percentage
#### - Population is in the thousands
#### - Area is accurate (when I checked US sqkm)
#### - Density (Vatican is .44 sqkm and has a lower density than it should)

---
---

### Birth and Mortality merge

In [28]:
bam = pd.merge(bd,mo)
print(bam.shape)
bam.head()

(15106, 11)

,country_name,year,crude_birth_rate,crude_death_rate,net_migration,rate_natural_increase,growth_rate,infant_mortality,life_expectancy,mortality_rate_under5,mortality_rate_1to4
0,Slovenia,2036,7.59,14.65,0.23,-0.706,-0.682,3.39,80.90,3.93,0.54
1,Slovenia,2022,7.52,12.28,0.32,-0.476,-0.444,3.76,79.11,4.43,0.68
2,Slovenia,2023,7.43,12.41,0.31,-0.498,-0.467,3.73,79.26,4.39,0.67
3,Slovenia,2024,7.35,12.55,0.31,-0.520,-0.489,3.70,79.40,4.35,0.65
4,Slovenia,2025,7.30,12.68,0.30,-0.538,-0.508,3.67,79.55,4.31,0.64

In [29]:
bd.head(2)

,country_name,year,crude_birth_rate,crude_death_rate,net_migration,rate_natural_increase,growth_rate
0,Slovenia,2036,7.59,14.65,0.23,-0.706,-0.682
1,Slovenia,2022,7.52,12.28,0.32,-0.476,-0.444

In [30]:
mo.head(2)

,country_name,year,infant_mortality,life_expectancy,mortality_rate_under5,mortality_rate_1to4
0,Slovenia,2036,3.39,80.90,3.93,0.54
1,Slovenia,2022,3.76,79.11,4.43,0.68

## Predict the top and bottom 5 populated countries?

### .csv list:

### Not needed:
##### - country_names_area.csv

##### - midyear_population_5yr_age_sex.csv

##### - midyear_population_age_country_code.csv

##### - age_specific_fertility_rates.csv
(15106, 13)

##### - midyear_population.csv (mp1)
(23028, 3)

#### Data Dictionary:

- Data dictionary.txt 

### Using:
##### - midyear_population_age_sex.csv
(30280, 105)
##### mortality_life_expectancy.csv (mo)
(15106, 15)
##### - birth_death_growth_rates.csv (bd)
(15109, 7)
#### mo+bd combined into bam

---

In [52]:
world.head(3)

,Name,2022,2020,2015,2010,2000,1990,1980,1970,Area (km²),Density (per km²),GrowthRate,World Population Percentage,Rank
0,China,1425887,1424930,1393715,1348191,1264099,1153704,982372,822534,9706961,146.8933,1.00,17.88%,1
1,India,1417173,1396387,1322867,1240614,1059634,870452,696828,557501,3287590,431.0675,1.01,17.77%,2
2,United States,338290,335942,324608,311183,282399,248084,223140,200328,9372610,36.0935,1.00,4.24%,3

In [53]:
world.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 14 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Name                         234 non-null    object
 1   2022                         234 non-null    int64
 2   2020                         234 non-null    int64
 3   2015                         234 non-null    int64
 4   2010                         234 non-null    int64
 5   2000                         234 non-null    int64
 6   1990                         234 non-null    int64
 7   1980                         234 non-null    int64
 8   1970                         234 non-null    int64
 9   Area (km²)                   234 non-null    int64
 10  Density (per km²)            234 non-null    float64
 11  GrowthRate                   234 non-null    float64
 12  World Population Percentage  234 non-null    object
 13  Rank                         234 non-null    int64
dtypes: float64(2), int64(10), object(2)
memory usage: 25.7+ KB

pd.pivot_table(mp1, values='midyear_population', index='country_name', columns='year')

In [56]:
pd.pivot_table(world, values=world['2022'], index=world.index, columns='Name')

KeyError: 1425887